embarquech/cryptnox-sdk-esp32/examples/usdc_signing/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Enough stack for TLS + JSON + crypto operations in app_main
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# mbedTLS certificate bundle for HTTPS RPC endpoints
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# HTTPS support in the HTTP client
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# CYD has 4 MB flash — use a partition table with a larger app slot
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=n
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_SINGLE_APP=n
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
